Emile666/C100_pid_stm8s105/src/c100_pid_main.c
    temp_err    = false;               // assume all is well
    temp_tc     = max31855_read(&err); // K-type thermocouple
    err1        = ((err & TC_ERR_OC) > 0);
    if (err1) 
    {   // No thermocouple sensor present, try PT100 sensor
        temp_tc_fil = TEMP_ROOM;           // reset TC-temperature to default
        temp_pt     = max31865_read(&err); // Read PT100 temperature
        if (err)
        {   // No sensors detected
            temp_pt_fil = TEMP_ROOM; // Reset PT100-temperature
            temp_tc_pt  = 0;         // Default temperature to 0.0 °C
            temp_err    = true;      // No sensors detected
        } // if
        else
        {   // PT100 sensor present and no TC sensor, so use PT100 temperature
            temp_pt_fil = ((temp_pt_fil - (temp_pt_fil >> FILTER_SHIFT)) + temp_pt);
            temp_tc_pt  = (int16_t)((temp_pt_fil + FILTER_ROUND) >> FILTER_SHIFT); 
            temp_tc_pt += eeprom_read_config(EEADR_MENU_ITEM(tc2));
        } // else
    } // if
    else
    {  // Thermocouple sensor present, so use that temperature
       temp_tc_fil = ((temp_tc_fil - (temp_tc_fil >> FILTER_SHIFT)) + temp_tc);
       temp_tc_pt  = (int16_t)((temp_tc_fil + FILTER_ROUND) >> FILTER_SHIFT); 
       temp_tc_pt += eeprom_read_config(EEADR_MENU_ITEM(tc));
    } // else
} // adc_task()

/*-----------------------------------------------------------------------------
  Purpose  : This task is called every 100 msec. and reads the buttons, runs
             the STD and updates the 7-segment display.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void std_task(void)
{
    read_buttons(); // reads the buttons keys, result is stored in _buttons
    menu_fsm();     // Finite State Machine menu
    pid_to_time();  // Make Slow-PWM signal and send to Solid-State Relay (SSR)
} // std_task()

/*-----------------------------------------------------------------------------
  Purpose  : This task is called every second and contains the main control
             task for the device. It also calls temperature_control().
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void ctrl_task(void)
{
   int16_t sa, diff;
   
    if (eeprom_read_config(EEADR_MENU_ITEM(CF))) // true = Fahrenheit
         fahrenheit = true;
    else fahrenheit = false;
    if (eeprom_read_config(EEADR_MENU_ITEM(HrS))) // true = hours
         minutes = false; // control-timing is in hours 
    else minutes = true;  // control-timing is in minutes

   // Start with updating the alarm
   if (temp_err)
   {
       relay_alarm1 = true;
       if (menu_is_idle)
       {  // Make it less anoying to nagivate menu during alarm
          top_100 = LED_A; top_10  = LED_L;
          top_1   = LED_0; top_01  = LED_1; // sensor not connected alarm
          bot_100 = LED_n; bot_10  = LED_o;
          bot_1   = LED_P; bot_01  = LED_b; // noPb = no Probe
       } // if
       cooling_delay = heating_delay = 60;
   } else {
       relay_alarm1 = false; // reset the piezo buzzer
       if(((uint8_t)eeprom_read_config(EEADR_MENU_ITEM(rn))) < THERMOSTAT_MODE)
            leds_out |=  (LED_AT | LED_AT_BLINK); // Indicate profile mode
       else leds_out &= ~(LED_AT | LED_AT_BLINK);
 
       ts = eeprom_read_config(EEADR_MENU_ITEM(Ts)); // Read Ts [seconds]
       sa = eeprom_read_config(EEADR_MENU_ITEM(SA)); // Show Alarm parameter
       if (sa)
       {
            if (minutes) // is timing-control in minutes?
                 diff = temp_tc_pt - setpoint;
            else diff = temp_tc_pt - eeprom_read_config(EEADR_MENU_ITEM(SP));
            if (diff < 0) 
                 diff = -diff;
            if (sa < 0)
            {
                 sa = -sa;
                 relay_alarm1 = (diff <= sa); // enable relay if diff is small
            } else {
                 relay_alarm1 = (diff >= sa); // enable relay if diff is large
            } // if
       } // if
       if (ts == 0)              // PID Ts parameter is 0?
       {
            init_temp_delays();  // Initialise Heating and Cooling delay
            pid_out = 0;         // Disable PID-output
       } // if
       else pid_control();       // Run PID controller
       if (menu_is_idle)         // show temperature if menu is idle
       {
            value_to_led(temp_tc_pt,LEDS_TEMP,ROW_TOP); // display temperature on top-row
            value_to_led(setpoint  ,LEDS_TEMP,ROW_BOT); // display setpoint on bottom-row
       } // if
   } // else
   if (relay_alarm1)
   {
        leds_out |= LED_ALM1 | LED_ALM1_BLINK;
        ALARM_ON;
   }
   else
   {
       leds_out &= ~(LED_ALM1 | LED_ALM1_BLINK);
       ALARM_OFF;
   } // else
} // ctrl_task()

/*-----------------------------------------------------------------------------
  Purpose  : This task is called every minute or every hour and updates the
             current running temperature profile.
  Variables: minutes: timing control: false = hours, true = minutes
  Returns  : -
  ---------------------------------------------------------------------------*/
void prfl_task(void)
{
    static uint8_t min = 0;
    
    if (minutes)
    {   // call every minute
        update_profile();
        min = 0;
    } else {
        if (++min >= 60)
        {   // call every hour
            min = 0;
            update_profile(); 
        } // if
    } // else
} // prfl_task();

/*-----------------------------------------------------------------------------
  Purpose  : This routine initialises the system clock to run at 16 MHz.
             It uses the internal HSI oscillator.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void initialise_system_clock(void)
{
	CLK_ICKCR  = 0;                //  Reset the Internal Clock Register.
    CLK_ICKCR |= CLK_ICKCR_HSIEN;  //  Enable the HSI.
    while ((CLK_ICKCR & CLK_ICKCR_HSIRDY) == 0); //  Wait for the HSI to be ready for use.
    CLK_CKDIVR     = 0;            //  Ensure the clocks are running at full speed.
 
    // The datasheet lists that the max. ADC clock is equal to 6 MHz (4 MHz when on 3.3V).
    // Because fMASTER is now at 16 MHz, we need to set the ADC-prescaler to 4.
    ADC_CR1     &= ~ADC_CR1_SPSEL_MSK;
    ADC_CR1     |= 0x20;          //  Set prescaler (SPSEL bits) to 4, fADC = 4 MHz
    CLK_SWIMCCR  = 0x00;          //  Set SWIM to run at clock / 2.
    CLK_SWR      = 0xE1;          //  Use HSI as the clock source.
    CLK_SWCR     = 0x00;          //  Reset the clock switch control register.
    CLK_SWCR    |= CLK_SWCR_SWEN; //  Enable switching.
    while ((CLK_SWCR & CLK_SWCR_SWBSY) != 0);  //  Pause while the clock switch is busy.
} // initialise_system_clock()

/*-----------------------------------------------------------------------------
  Purpose  : This is the main entry-point for the entire program.
             It initialises everything, starts the scheduler and dispatches
             all tasks.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
int main(void)
{
	long i;
	int ee = eedata[0]; // This is to prevent the linker from removing .eeprom section
	
	disable_interrupts();      // no interrupts yet
	initialise_system_clock(); // set main-clock to 16 MHz
	setup_gpio_ports();        // Initialise all GPIO ports
	setup_timer2();            // set TMR2 clock to 1 kHz for interrupt
    spi_init();                // Init. SPI interface
    max31865_init();           // Init. PT100 device
    
	// Initialise all tasks for the scheduler
    scheduler_init();                    // init. task scheduler
    add_task(adc_task ,"ADC",  0,  500); // every 500 msec.
    add_task(std_task ,"STD", 50,  100); // every 100 msec.
    add_task(ctrl_task,"CTL",200, 1000); // every second
    add_task(prfl_task,"PRF",300,60000); // every minute / hour
	enable_interrupts();                 // enable interrupts

	while (1)
	{ 	// background-processes
        dispatch_tasks();     // Run task-scheduler()
        wait_for_interrupt(); // do nothing
	} // while
} // main()